# GetSavedOrientation Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View3D..::..GetSavedOrientation Method
View3D Class See Also
---
Gets the saved orientation of the View3D.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ViewOrientation3D GetSavedOrientation()
```

Visual Basic
---
```text
Public Function GetSavedOrientation As ViewOrientation3D
```

Visual C++
---
```text
public:
ViewOrientation3D^ GetSavedOrientation()
```

# ### Return Value
The saved orientation of the View3D.
# See Also
View3D Class
Autodesk.Revit.DB Namespace